scenario/scenario-0.yml
config:
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Warm up the application 5 user for 30s"
    - duration: 30
      arrivalRate: 5
    - duration: 30
      arrivalRate: 10
    - duration: 30
      arrivalRate: 20
    - duration: 60
      arrivalRate: 50
  payload:
    -
      path: "../data/mail.csv"
      fields:
        - "emailonly"
  environments:
    dev:
      target: "http://api.dev"
    prod:
      target: "http://api.prod"
scenarios:
  - name: "Candidat deja inscrit"
    flow:
      - post:
          url: "/candilibV2/api/v2/auth/candidat/magic-link"
          json:
            email: "{{ emailonly }}"